In [1]:
import pandas as pd
df = pd.read_excel('../data/score.xlsx',index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    강나래  구로고  197   90    5  100  95  85      python
2번    강태원  구로고  184   40   35   50  55  25        Java
3번    강호림  구로고  168   80   75   70  80  75  Javascript
4번    김수찬  구로고  187   40   60   70  75  80         NaN
5번    김재욱  구로고  188   15   20   10  35  10         NaN
6번    박동현  구로고  202   80  100   95  85  80           C
7번    박혜정  단지고  188   55   65   45  40  35      PYTHON
8번    승근열  단지고  190  100   85   90  95  95          C#

#### groupby -그룹화

In [2]:
#학교에는 구로고,단지고가 있다
df.groupby('학교')

In [3]:
#구로고에 해당되는 내용만 나온다
df.groupby('학교').get_group('구로고')

       이름   학교    키  국어   영어   수학  과학  사회        SW특기
지원번호
1번    강나래  구로고  197  90    5  100  95  85      python
2번    강태원  구로고  184  40   35   50  55  25        Java
3번    강호림  구로고  168  80   75   70  80  75  Javascript
4번    김수찬  구로고  187  40   60   70  75  80         NaN
5번    김재욱  구로고  188  15   20   10  35  10         NaN
6번    박동현  구로고  202  80  100   95  85  80           C

In [4]:
df.groupby('학교').get_group('단지고')

       이름   학교    키   국어  영어  수학  과학  사회    SW특기
지원번호
7번    박혜정  단지고  188   55  65  45  40  35  PYTHON
8번    승근열  단지고  190  100  85  90  95  95      C#

In [5]:
# 각각 학교별 개수가 몇개인지 파악가능
df.groupby('학교').size()

학교
구로고    6
단지고    2
dtype: int64

In [9]:
# 구로고 개수만 알려줘!!!
# df.groupby('학교').size()['구로고']

# 단지고 개수만 알려줘!!!
df.groupby('학교').size()['단지고']

2

In [10]:
#각각 학교의 키의 평균을 알려준다..
df.groupby('학교')['키'].mean()

학교
구로고    187.666667
단지고    189.000000
Name: 키, dtype: float64

In [12]:
#각각 학교의 각 과목의 평균을 알려준다..
df.groupby('학교')[['키','국어','영어','수학','과학','사회']].mean()

              키    국어         영어         수학         과학         사회
학교
구로고  187.666667  57.5  49.166667  65.833333  70.833333  59.166667
단지고  189.000000  77.5  75.000000  67.500000  67.500000  65.000000